In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv('bank-data.csv')

In [3]:
data.head()

   age          job  marital    y
0   20      student   single  yes
1   32   management   single  yes
2   49   technician  married  yes
3   32  blue-collar  married  yes
4   33   management  married  yes

In [4]:
y = data['y']
y = y.replace(['yes','no'],(1,0))
print(y)

0      1
1      1
2      1
3      1
4      1
5      1
6      1
7      1
8      1
9      1
10     1
11     1
12     1
13     1
14     1
15     1
16     1
17     1
18     1
19     1
20     1
21     1
22     1
23     1
24     1
25     1
26     1
27     1
28     1
29     1
      ..
417    1
418    1
419    1
420    1
421    1
422    1
423    1
424    1
425    1
426    1
427    1
428    1
429    1
430    1
431    1
432    1
433    1
434    1
435    1
436    1
437    1
438    1
439    1
440    1
441    1
442    1
443    1
444    1
445    1
446    1
Name: y, Length: 447, dtype: object

In [6]:
data['job'].value_counts()

management       131
technician        83
blue-collar       69
admin.            58
services          38
self-employed     20
student           19
entrepreneur      15
housemaid         14
Name: job, dtype: int64

In [7]:
data['job']

0            student
1         management
2         technician
3        blue-collar
4         management
5             admin.
6        blue-collar
7         technician
8         management
9             admin.
10          services
11        management
12          services
13           student
14           student
15        technician
16     self-employed
17        management
18            admin.
19        management
20        technician
21       blue-collar
22        management
23       blue-collar
24       blue-collar
25            admin.
26       blue-collar
27      entrepreneur
28       blue-collar
29      entrepreneur
           ...
417    self-employed
418         services
419       technician
420      blue-collar
421       technician
422       technician
423       management
424        housemaid
425       technician
426          student
427       management
428       management
429           admin.
430           admin.
431      blue-collar
432      blue-collar
433     entrepreneur
434           admin.
435      blue-collar
436       management
437       management
438      blue-collar
439       management
440       management
441       management
442       technician
443    self-employed
444      blue-collar
445           admin.
446      blue-collar
Name: job, Length: 447, dtype: object

In [8]:
profession = input('Enter your profession :')

Enter your profession :str

In [ ]:
if profession